## Generated SDC file "dmb1test.sdc"

## Copyright (C) 1991-2016 Altera Corporation. All rights reserved.
## Your use of Altera Corporation's design tools, logic functions 
## and other software and tools, and its AMPP partner logic 
## functions, and any output files from any of the foregoing 
## (including device programming or simulation files), and any 
## associated documentation or information are expressly subject 
## to the terms and conditions of the Altera Program License 
## Subscription Agreement, the Altera Quartus Prime License Agreement,
## the Altera MegaCore Function License Agreement, or other 
## applicable license agreement, including, without limitation, 
## that your use is for the sole purpose of programming logic 
## devices manufactured by Altera and sold by Altera or its 
## authorized distributors.  Please refer to the applicable 
## agreement for further details.


## VENDOR  "Altera"
## PROGRAM "Quartus Prime"
## VERSION "Version 16.0.0 Build 211 04/27/2016 SJ Lite Edition"

## DATE    "Wed Apr 04 17:16:17 2018"

##
## DEVICE  "5CEFA7F23I7"
##


#**************************************************************
# Time Information
#**************************************************************

set_time_format -unit ns -decimal_places 3



#**************************************************************
# Create Clock
#**************************************************************

create_clock -name {IF_SYS_CLK} -period 50.000 -waveform { 0.000 25.000 } [get_ports {IF_SYS_CLK}]
create_clock -name {RESET_SIG} -period 1.000 -waveform { 0.000 0.500 } [get_registers {RESET_SIG}]


#**************************************************************
# Create Generated Clock
#**************************************************************

create_generated_clock -name {A1|sys_pll_inst|altera_pll_i|general[0].gpll~FRACTIONAL_PLL|vcoph[0]} -source [get_pins {A1|sys_pll_inst|altera_pll_i|general[0].gpll~FRACTIONAL_PLL|refclkin}] -duty_cycle 50/1 -multiply_by 30 -divide_by 2 -master_clock {IF_SYS_CLK} [get_pins {A1|sys_pll_inst|altera_pll_i|general[0].gpll~FRACTIONAL_PLL|vcoph[0]}] 
create_generated_clock -name {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk} -source [get_pins {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|vco0ph[0]}] -duty_cycle 50/1 -multiply_by 1 -divide_by 6 -master_clock {A1|sys_pll_inst|altera_pll_i|general[0].gpll~FRACTIONAL_PLL|vcoph[0]} [get_pins {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] 


#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************

set_clock_uncertainty -rise_from [get_clocks {RESET_SIG}] -rise_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -setup 0.070  
set_clock_uncertainty -rise_from [get_clocks {RESET_SIG}] -rise_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -hold 0.080  
set_clock_uncertainty -rise_from [get_clocks {RESET_SIG}] -fall_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -setup 0.070  
set_clock_uncertainty -rise_from [get_clocks {RESET_SIG}] -fall_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -hold 0.080  
set_clock_uncertainty -rise_from [get_clocks {RESET_SIG}] -rise_to [get_clocks {IF_SYS_CLK}]  0.050  
set_clock_uncertainty -rise_from [get_clocks {RESET_SIG}] -fall_to [get_clocks {IF_SYS_CLK}]  0.050  
set_clock_uncertainty -fall_from [get_clocks {RESET_SIG}] -rise_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -setup 0.070  
set_clock_uncertainty -fall_from [get_clocks {RESET_SIG}] -rise_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -hold 0.080  
set_clock_uncertainty -fall_from [get_clocks {RESET_SIG}] -fall_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -setup 0.070  
set_clock_uncertainty -fall_from [get_clocks {RESET_SIG}] -fall_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -hold 0.080  
set_clock_uncertainty -fall_from [get_clocks {RESET_SIG}] -rise_to [get_clocks {IF_SYS_CLK}]  0.050  
set_clock_uncertainty -fall_from [get_clocks {RESET_SIG}] -fall_to [get_clocks {IF_SYS_CLK}]  0.050  
set_clock_uncertainty -rise_from [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {RESET_SIG}] -setup 0.080  
set_clock_uncertainty -rise_from [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {RESET_SIG}] -hold 0.070  
set_clock_uncertainty -rise_from [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {RESET_SIG}] -setup 0.080  
set_clock_uncertainty -rise_from [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {RESET_SIG}] -hold 0.070  
set_clock_uncertainty -rise_from [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -setup 0.110  
set_clock_uncertainty -rise_from [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -setup 0.110  
set_clock_uncertainty -rise_from [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {RESET_SIG}] -setup 0.080  
set_clock_uncertainty -fall_from [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {RESET_SIG}] -hold 0.070  
set_clock_uncertainty -fall_from [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {RESET_SIG}] -setup 0.080  
set_clock_uncertainty -fall_from [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {RESET_SIG}] -hold 0.070  
set_clock_uncertainty -fall_from [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -setup 0.110  
set_clock_uncertainty -fall_from [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -rise_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -setup 0.110  
set_clock_uncertainty -fall_from [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -fall_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {IF_SYS_CLK}] -rise_to [get_clocks {RESET_SIG}]  0.050  
set_clock_uncertainty -rise_from [get_clocks {IF_SYS_CLK}] -fall_to [get_clocks {RESET_SIG}]  0.050  
set_clock_uncertainty -rise_from [get_clocks {IF_SYS_CLK}] -rise_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.120  
set_clock_uncertainty -rise_from [get_clocks {IF_SYS_CLK}] -fall_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.120  
set_clock_uncertainty -rise_from [get_clocks {IF_SYS_CLK}] -rise_to [get_clocks {IF_SYS_CLK}] -setup 0.100  
set_clock_uncertainty -rise_from [get_clocks {IF_SYS_CLK}] -rise_to [get_clocks {IF_SYS_CLK}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {IF_SYS_CLK}] -fall_to [get_clocks {IF_SYS_CLK}] -setup 0.100  
set_clock_uncertainty -rise_from [get_clocks {IF_SYS_CLK}] -fall_to [get_clocks {IF_SYS_CLK}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {IF_SYS_CLK}] -rise_to [get_clocks {RESET_SIG}]  0.050  
set_clock_uncertainty -fall_from [get_clocks {IF_SYS_CLK}] -fall_to [get_clocks {RESET_SIG}]  0.050  
set_clock_uncertainty -fall_from [get_clocks {IF_SYS_CLK}] -rise_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.120  
set_clock_uncertainty -fall_from [get_clocks {IF_SYS_CLK}] -fall_to [get_clocks {A1|sys_pll_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}]  0.120  
set_clock_uncertainty -fall_from [get_clocks {IF_SYS_CLK}] -rise_to [get_clocks {IF_SYS_CLK}] -setup 0.100  
set_clock_uncertainty -fall_from [get_clocks {IF_SYS_CLK}] -rise_to [get_clocks {IF_SYS_CLK}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {IF_SYS_CLK}] -fall_to [get_clocks {IF_SYS_CLK}] -setup 0.100  
set_clock_uncertainty -fall_from [get_clocks {IF_SYS_CLK}] -fall_to [get_clocks {IF_SYS_CLK}] -hold 0.060  


#**************************************************************
# Set Input Delay
#**************************************************************



#**************************************************************
# Set Output Delay
#**************************************************************



#**************************************************************
# Set Clock Groups
#**************************************************************



#**************************************************************
# Set False Path
#**************************************************************



#**************************************************************
# Set Multicycle Path
#**************************************************************



#**************************************************************
# Set Maximum Delay
#**************************************************************



#**************************************************************
# Set Minimum Delay
#**************************************************************



#**************************************************************
# Set Input Transition
#**************************************************************

